Revit 2024 API
CutFailureReason Enumeration
 The reason why a solid-solid cut cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum CutFailureReason
Visual Basic
Public Enumeration CutFailureReason
Visual C++
public enum class CutFailureReason
Members
Member name | Description
CutAllowed |  Yes, the cutting element can add a cut to the target element.
CutAlreadyExists |  The cutting element has already cut the target element.
OppositeCutExists |  The target element has already cut the cutting element.
CutNotAppropriateForElements |  The cut is not appropriate for the two elements.
See Also
Autodesk.Revit.DB Namespace